---
title: "Dominant"
format: html
engine: markdown
bibliography: ../Bibliography.bib
cls: apa
---

---
nocite: |
  @ns, @JMDA
---

<!-- DefiniciÃ³n de Num. Sem. -->

## Definition

Let $S$ be a [numerical semigroup](Numerical-semigroup.qmd) with positive [conductor](Conductor.qmd) $C(S)$. It is defined the dominant of $S$, denoted by $d(S)$, as $d(S) = \max \{s \in S ~ | ~ s < C(S)\}$.

## Examples

$\circ$ Let $S = \langle 3, 7, 11 \rangle$. We have that $9, 10, 11 \in S$ and $8 \not \in S$, therefore the conductor is $C(S) = 9$, and the dominant is $d(S) = 7$. This numerical semigroup is also [acute](../Families-NS/NS-acute.qmd), since $C(S) - d(S) = 2$.

## Examples with GAP

Nowadays, there are no functions in package NumericalSgps related to dominant of a numerical semigroup. However, the following function in GAP returns the dominant of a given numerical semigroup.

``` gap
gap> DominantOfNumericalSemigroup := function(S)
>       local n;
>       if not IsNumericalSemigroup(S) then
>               Error("The argument must be a Numerical Semigroup");
>       fi;
>       if Conductor(S) <= 0 then
>               Error("The conductor must be a positive integer");
>       fi;
>       n := Length(SmallElements(S));
>       return SmallElements(S)[n-1];
>       
> end;
function( S ) ... end
```

$\diamond$ Let $S = \langle 7, 22, 47, 52 \rangle$, in GAP:

``` gap
gap> S := NumericalSemigroup(7, 22, 47, 52);
<Numerical semigroup with 4 generators>
```

If we compute the [small elements](Left-elements.qmd) of $S$,

``` gap
gap> SmallElements(S);
[ 0, 7, 14, 21, 22, 28, 29, 35, 36, 42, 43, 44, 47, 49, 50, 51,
  52, 54, 56, 57, 58, 59, 61, 63, 64, 65, 66, 68 ]
```

Then, the dominant of $S$ is $d(S) = 66$. With the function defined above,

``` gap
gap> DominantOfNumericalSemigroup(S);
66
```

## References

::: {#refs}

:::
